{
  "stories": [
    {
      "id": 1,
      "username": "AdityaDwiNugroho",
      "name": "Aditya Dwi Nugroho",
      "githubUrl": "https://github.com/AdityaDwiNugroho",
      "date": "October 2025",
      "title": "Starting This Project",
      "story": "I created this project to help people practice their first contributions during Hacktoberfest. I wanted to make something simple where anyone could participate, regardless of their coding skills.",
      "tags": ["creator", "hacktoberfest", "first-project"]
    },
    {
      "id": 2,
      "username": "Lightningxyz",
      "name": "Karan R",
      "githubUrl": "https://github.com/Lightningxyz",
      "date": "October 2025",
      "title": "My Open Source Journey",
      "story": "I am pretty new to contributing to open source, but have been a fan of open source software forever. The idea that a group of people can collectively create products that are sometimes close to or even better than mega corporations is what surprised me. This motivated me to learn how to contribute to open source and here I am, trying to slowly learn various aspects of contributing.",
      "tags": ["beginner", "learning", "hacktoberfest"]
    },
    {
      "id": 3,
      "username": "example-user",
      "name": "Example Contributor",
      "githubUrl": "https://github.com/example-user",
      "date": "October 2025",
      "title": "My First Open Source Contribution",
      "story": "This was my first time contributing to open source! I was nervous at first, but the process was really simple. I just added my story to the JSON file and created a pull request. The maintainer was super helpful and merged it quickly. Now I feel confident to contribute to more projects!",
      "tags": ["beginner", "first-contribution", "hacktoberfest"]
    },
    {
  "id": 4,
  "username": "singhcod3r",
  "name": "Ayush Singh",
  "githubUrl": "https://github.com/SinghCod3r",
  "date": "October 2025",
  "title": "My Open Source Journey Started with Curiosity",
  "story": "I got interested in open source through programs like GSoC and Code4GovTech. However, due to a lack of experience at the time, I decided to start exploring GitHub and contributing on my own. My first real contribution was to the Medic organization, which is a part of Code4GovTech. After that, I contributed to WPRig and several other projects. These early steps helped me understand how open source works, and I’ve been learning ever since. It’s been a rewarding journey of growth, and I encourage beginners to start small and stay consistent.",
  "tags": ["beginner", "hacktoberfest", "first-contribution", "learning"]
},
{
    "id": 5,
    "username": "HiddenKeyDev",
    "name": "HiddenKeyDev",
    "githubUrl": "https://github.com/HiddenKeyDev",
    "date": "October 2025",
    "title": "My First Contribution After Months of Tutorial Hell",
    "story": "I've been learning React for about six months now. Mostly following tutorials on YouTube, building the same to-do apps and weather apps everyone builds, then abandoning them halfway through. My GitHub looks pretty empty because honestly, I never thought my code was good enough to push. I'd start projects, get stuck on something, Google it for hours, then just give up and start a new tutorial. Classic tutorial hell. When Hacktoberfest came around, I wanted to participate but every project I looked at seemed way too advanced. Then I found this one. Just adding a story to a JSON file. No complex algorithms, no fancy React components, just... sharing something real. And I still hesitated for three days before actually doing it. I kept thinking 'my story isn't interesting enough' or 'I haven't contributed to anything real yet so what do I even say?' But then I realized that IS my story - the hesitation, the self-doubt, the endless tutorials without actually building anything original. I'm not employed as a developer yet. I'm not even sure I'm good enough to apply for jobs. But I'm here, making my first contribution, even if it's small. Sometimes the hardest part isn't the code - it's believing your participation actually matters. So here it is. My first merged PR. Hopefully the first of many.",
    "tags": ["beginner", "hacktoberfest", "first-contribution", "learning"]
  },
  {
    "id": 6,
    "username": "antfu",
    "name": "Anthony Fu",
    "githubUrl": "https://github.com/antfu",
    "date": "October 2025",
    "title": "Building Tools That Spark Joy",
    "story": "My open source journey has been about creating tools that I wish existed. It started with small utilities to solve my own problems, then evolved into projects like Vitest, Slidev, and UnoCSS. What drives me is the idea of developer experience - making tools that are not just functional, but delightful to use. I believe good DX isn't just about performance or features, it's about the small details that make developers smile. Every project I work on, whether it's a testing framework or a presentation tool, starts with the question: 'How can this be more enjoyable?' Open source taught me that when you build something useful and share it freely, amazing things happen. People contribute, iterate, and build upon your ideas in ways you never imagined. Hacktoberfest represents this spirit perfectly - it's about collaboration, learning, and giving back to the community that has given us so much. My advice: don't wait for the perfect idea. Build what you need, share it openly, and be surprised by what the community creates together.",
    "tags": ["advanced", "maintainer", "vue", "vite", "typescript", "tooling"]
  },
  {
    "id": 7,
    "username": "ry",
    "name": "Ryan Dahl",
    "githubUrl": "https://github.com/ry",
    "date": "October 2025",
    "title": "Lessons from Building Runtime Environments",
    "story": "Creating Node.js taught me that sometimes the best ideas come from questioning established patterns. I wanted JavaScript on the server because V8 made it possible, and the async I/O model felt right. Years later with Deno, I got to revisit those decisions with hindsight. The mistakes I made with Node.js - the module system, security model, build complexity - became opportunities to do better. Open source is iterative. You release something, the community uses it in ways you never imagined, and you learn. Node became bigger than I ever expected, and that taught me humility. Your code will outlive your involvement in it. Make it count, but also be willing to let go and let others steer. The most rewarding part isn't the downloads or stars - it's seeing people build amazing things you never thought possible.",
    "tags": ["creator", "javascript", "nodejs", "deno", "runtime"]
  },
  {
    "id": 8,
    "username": "dhh",
    "name": "David Heinemeier Hansson",
    "githubUrl": "https://github.com/dhh",
    "date": "October 2025",
    "title": "Convention Over Configuration Changed Everything",
    "story": "When I extracted Ruby on Rails from Basecamp, I was just trying to avoid repeating myself. I was tired of writing the same boilerplate for every web app. The insight was simple: most web applications need the same things, so why not make those the defaults? Convention over configuration wasn't about being clever - it was about being lazy in the right way. Open source gave Rails wings I could never have given it alone. Thousands of developers contributed patterns, gems, and ideas that made it exponentially better. What I learned: Strong opinions, weakly held. Be opinionated in your design, but listen when the community shows you a better way. The web needed Rails-like frameworks, and Rails needed the community. It's a beautiful symbiosis.",
    "tags": ["creator", "ruby", "rails", "web", "framework"]
  }
  ]
}
